backend/models/SmsAdmin.php

    public static function findByUsername($phone_num) {
        $user = SmsAdmin::find()->where(['phone_num' => $phone_num])->one();
---
SELECT * FROM `sms_admin` WHERE `phone_num`='1111111'